Series in pandas is a column in a table

In [2]:
import numpy as np
import pandas as pd

In [3]:
#series storing strings

In [4]:
countries = ['India','Pakistan','England','Wales','Scotland','North Ireland']

pd.Series(countries)

0            India
1         Pakistan
2          England
3            Wales
4         Scotland
5    North Ireland
dtype: object

In [5]:
#series for integer values

In [6]:
pd.Series([12,34,45,33,199])

0     12
1     34
2     45
3     33
4    199
dtype: int64

In [7]:
#custom indexing

In [8]:
subjects=['maths','english','chemistry','physics','DAA']
marks=[12,23,44,22,12]
pd.Series(marks,index=subjects)

maths        12
english      23
chemistry    44
physics      22
DAA          12
dtype: int64

In [9]:
#Naming our series!
pd.Series(marks,index=subjects,name='Faisal\'s marks')

maths        12
english      23
chemistry    44
physics      22
DAA          12
Name: Faisal's marks, dtype: int64

In [10]:
#turning dict's into pandas Series
dict={
    'maths':44,
    'python':44,
    'DAA':34,
    'ALTC':50,
}

marks_series = pd.Series(dict,name='Faisal\'s marks')

In [11]:
marks_series.size

4

In [12]:
marks_series.dtype

dtype('int64')

In [13]:

marks_series.name

"Faisal's marks"

In [14]:
marks_series.is_unique

False

In [15]:
marks_series.index

Index(['maths', 'python', 'DAA', 'ALTC'], dtype='object')

In [16]:
marks_series.values  #returns a numpy array

array([44, 44, 34, 50])

In [17]:
test = pd.read_csv('student_performance.csv')

In [18]:
Student_details = pd.read_csv('student_performance.csv',index_col='StudentID')

In [19]:
test.head(29)

,StudentID,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
0,1,John,Male,85,15,78,1,High,80
1,2,Sarah,Female,90,20,85,2,Medium,87
2,3,Alex,Male,78,10,65,0,Low,68
3,4,Michael,Male,92,25,90,3,High,92
4,5,Emma,Female,88,18,82,2,Medium,85
5,6,Olivia,Female,95,30,88,1,High,90
6,7,Daniel,Male,70,8,60,0,Low,62
7,8,Sophia,Female,85,17,77,1,Medium,78
8,9,James,Male,82,12,70,2,Low,72
9,10,Isabella,Female,91,22,86,3,High,88

In [20]:
Student_details.size

80

In [21]:
Student_details.dtypes

Name                         object
Gender                       object
AttendanceRate                int64
StudyHoursPerWeek             int64
PreviousGrade                 int64
ExtracurricularActivities     int64
ParentalSupport              object
FinalGrade                    int64
dtype: object

But Student_details is in a PANDAS Dataframe. We want it in Series. Previously was achieved using squeeze argument. But now thats not supported

In [22]:
New_method = pd.DataFrame.squeeze(Student_details)

In [23]:
New_method

,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
StudentID,,,,,,,,
1,John,Male,85,15,78,1,High,80
2,Sarah,Female,90,20,85,2,Medium,87
3,Alex,Male,78,10,65,0,Low,68
4,Michael,Male,92,25,90,3,High,92
5,Emma,Female,88,18,82,2,Medium,85
6,Olivia,Female,95,30,88,1,High,90
7,Daniel,Male,70,8,60,0,Low,62
8,Sophia,Female,85,17,77,1,Medium,78
9,James,Male,82,12,70,2,Low,72
10,Isabella,Female,91,22,86,3,High,88

In [24]:
marks_series.tail()

maths     44
python    44
DAA       34
ALTC      50
Name: Faisal's marks, dtype: int64

In [25]:
marks_series

maths     44
python    44
DAA       34
ALTC      50
Name: Faisal's marks, dtype: int64

In [26]:
student_marks = pd.Series(np.random.randint(1,10,20),name="Student_marks")

In [27]:
student_marks.tail()

15    3
16    8
17    6
18    3
19    2
Name: Student_marks, dtype: int32

In [28]:
Student_details.tail()

,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
StudentID,,,,,,,,
6,Olivia,Female,95,30,88,1,High,90
7,Daniel,Male,70,8,60,0,Low,62
8,Sophia,Female,85,17,77,1,Medium,78
9,James,Male,82,12,70,2,Low,72
10,Isabella,Female,91,22,86,3,High,88

In [29]:
test

,StudentID,Name,Gender,AttendanceRate,StudyHoursPerWeek,PreviousGrade,ExtracurricularActivities,ParentalSupport,FinalGrade
0,1,John,Male,85,15,78,1,High,80
1,2,Sarah,Female,90,20,85,2,Medium,87
2,3,Alex,Male,78,10,65,0,Low,68
3,4,Michael,Male,92,25,90,3,High,92
4,5,Emma,Female,88,18,82,2,Medium,85
5,6,Olivia,Female,95,30,88,1,High,90
6,7,Daniel,Male,70,8,60,0,Low,62
7,8,Sophia,Female,85,17,77,1,Medium,78
8,9,James,Male,82,12,70,2,Low,72
9,10,Isabella,Female,91,22,86,3,High,88

In [30]:
student_marks.sample()

12    3
Name: Student_marks, dtype: int32

In [31]:
student_marks.sample(6)

12    3
13    7
18    3
17    6
16    8
10    2
Name: Student_marks, dtype: int32

In [32]:
student_marks

0     9
1     5
2     9
3     3
4     8
5     2
6     4
7     8
8     1
9     1
10    2
11    1
12    3
13    7
14    6
15    3
16    8
17    6
18    3
19    2
Name: Student_marks, dtype: int32

In [33]:
student_marks.value_counts()

Student_marks
3    4
2    3
8    3
1    3
9    2
6    2
5    1
4    1
7    1
Name: count, dtype: int64

In [34]:
(student_marks.sort_values(ascending=False))

0     9
2     9
7     8
4     8
16    8
13    7
14    6
17    6
1     5
6     4
3     3
15    3
18    3
12    3
5     2
10    2
19    2
11    1
8     1
9     1
Name: Student_marks, dtype: int32

In [35]:
(student_marks.sort_values(ascending=False)).head(1).values[0]

np.int32(9)

In [36]:
#making permanent changes to series by using inplace parameter

In [37]:
marks_series

maths     44
python    44
DAA       34
ALTC      50
Name: Faisal's marks, dtype: int64

In [38]:
marks_series.sort_values(ascending=False,inplace=True)

In [39]:
Student_name = ['faisal','rizwan','118samad','zain']
Student_marks = [58,23,100,23]

results = pd.Series(Student_marks)

In [40]:
results.sort_index(ascending=False)#here it again accepts the inplace parameter

3     23
2    100
1     23
0     58
dtype: int64

In [41]:
marks_series

ALTC      50
maths     44
python    44
DAA       34
Name: Faisal's marks, dtype: int64

In [42]:
marks_series.sort_index()#sorting as per the index here, in the series function index parameter has been set to list of subjects hence the sorting is done on that basis

ALTC      50
DAA       34
maths     44
python    44
Name: Faisal's marks, dtype: int64

<h1>MATHS methods in series</h1>

In [43]:
marks_series.count() #count doesnt count missing values

np.int64(4)

In [44]:
marks_series.sum()

np.int64(172)

In [45]:
marks_series.product()

np.int64(3291200)

In [46]:
marks_series.mean()

np.float64(43.0)

In [47]:
marks_series.median()

np.float64(44.0)

In [48]:
student_marks.mode()

0    3
Name: Student_marks, dtype: int32

In [49]:
student_marks.value_counts()

Student_marks
3    4
2    3
8    3
1    3
9    2
6    2
5    1
4    1
7    1
Name: count, dtype: int64

In [50]:
student_marks.std()#standard deviation

np.float64(2.8372521918222215)

In [51]:
student_marks.var()#variance

np.float64(8.05)

In [52]:
student_marks.sum()

np.int64(91)

In [53]:
student_marks.min()

np.int32(1)

In [54]:
student_marks.describe()

count    20.000000
mean      4.550000
std       2.837252
min       1.000000
25%       2.000000
50%       3.500000
75%       7.250000
max       9.000000
Name: Student_marks, dtype: float64

<h1>INDEXING

In [56]:
student_marks[13]#negative indexing wont work!

np.int32(7)

In [59]:
marks_series[0]

C:\Users\faisa\AppData\Local\Temp\ipykernel_21384\3568604918.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  marks_series[0]

np.int64(50)

In [61]:
marks_series['ALTC']

np.int64(50)

In [62]:
marks_series[-1]

C:\Users\faisa\AppData\Local\Temp\ipykernel_21384\569294583.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  marks_series[-1]

np.int64(34)

In [63]:
marks_series

ALTC      50
maths     44
python    44
DAA       34
Name: Faisal's marks, dtype: int64

In [67]:
marks_series[::3]

ALTC    50
DAA     34
Name: Faisal's marks, dtype: int64

In [76]:
student_marks[-10:-5:2]

10    2
12    3
14    6
Name: Student_marks, dtype: int32

In [77]:
student_marks[[10,12,14]]#fancy indexing

10    2
12    3
14    6
Name: Student_marks, dtype: int32

<h1>EDITING

In [78]:
marks_series

ALTC      50
maths     44
python    44
DAA       34
Name: Faisal's marks, dtype: int64

In [79]:
marks_series['maths']=48

In [80]:
marks_series

ALTC      50
maths     48
python    44
DAA       34
Name: Faisal's marks, dtype: int64

In [81]:
marks_series['DSA']=55

In [82]:
marks_series

ALTC      50
maths     48
python    44
DAA       34
DSA       55
Name: Faisal's marks, dtype: int64

In [83]:
marks_series[[0,1]]=[10,8]

C:\Users\faisa\AppData\Local\Temp\ipykernel_21384\300697673.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks_series[[0,1]]=[10,8]

In [84]:
marks_series

ALTC      10
maths      8
python    44
DAA       34
DSA       55
Name: Faisal's marks, dtype: int64

In [85]:
nparray = np.array([[100,34,23],[3,4,5]])
np.clip(nparray,a_max=75,a_min=5)#clip function in numpy array!

array([[75, 34, 23],
       [ 5,  5,  5]])

<h1>Python functions with pandas

In [93]:
print(type(marks_series))
print(len(marks_series))
print(min(marks_series))
print(max(marks_series))
print(sorted(marks_series))
print(dir(marks_series))

<class 'pandas.core.series.Series'>
5
8
55
[8, 10, 34, 44, 55]
['ALTC', 'DAA', 'DSA', 'T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__bool__', '__class__', '__column_consortium_standard__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__float__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__int__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pandas_priority__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_agg_examples_doc', '_agg_see_also_doc', '_align_for_op', '_align_frame', '_align_series', '_append', '_arith_method', '_as_manager', '_attrs', '_binop', '_can_hold_na', '_check_inplace_and_allows_duplicate_labels', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_expanddim_from_mgr', '_constructor_from_mgr', '_data', '_deprecate_downcast', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_duplicated', '_find_valid_index', '_flags', '_flex_method', '_from_mgr', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_index_resolvers', '_get_label_or_level_values', '_get_numeric_data', '_get_rows_with_mask', '_get_value', '_get_values_tuple', '_get_with', '_getitem_slice', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_init_dict', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_cached', '_is_copy', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_is_view_after_cow_rules', '_item_cache', '_ixs', '_logical_func', '_logical_method', '_map_values', '_maybe_update_cacher', '_memory_usage', '_metadata', '_mgr', '_min_count_stat_function', '_name', '_needs_reindex_multi', '_pad_or_backfill', '_protect_consolidate', '_reduce', '_references', '_reindex_axes', '_reindex_indexer', '_reindex_multi', '_reindex_with_indexers', '_rename', '_replace_single', '_repr_data_resource_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_labels', '_set_name', '_set_value', '_set_values', '_set_with', '_set_with_engine', '_shift_with_freq', '_slice', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_latex_via_styler', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'backfill', 'between', 'between_time', 'bfill', 'bool', 'case_when', 'clip', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'interpolate', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'list', 'loc', 'lt', 'map', 'mask', 'maths', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'python', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'set_flags', 'shape', 'shift', 'size', 'skew', 'sort_index', 'sort_values', 'squeeze', 'std', 'struct', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

In [94]:
#type conversions
#1 lsit
list(marks_series)

[10, 8, 44, 34, 55]

In [96]:
#2dict
tuple(marks_series)

(10, 8, 44, 34, 55)

In [98]:
dict(marks_series)#NOT WORKING AS OF NOW!

TypeError: 'dict' object is not callable